nfs/fio-randread.log
job-randr: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randr;0;0;2097152;33941;8485;61787;1;6652;4.617789;13.258501;198;197467;3765.067501;972.449029;1.000000%=2342;5.000000%=2703;10.000000%=2899;20.000000%=3162;30.000000%=3358;40.000000%=3522;50.000000%=3653;60.000000%=3817;70.000000%=4014;80.000000%=4227;90.000000%=4685;95.000000%=5079;99.000000%=6520;99.500000%=7700;99.900000%=11468;99.950000%=14483;99.990000%=23986;0%=0;0%=0;0%=0;554;197470;3769.836413;972.517710;30240;35944;99.964980%;33929.113821;920.575267;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.788658%;5.308646%;511125;0;42;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;0.01%;0.21%;69.83%;29.77%;0.17%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randr: (groupid=0, jobs=1): err= 0: pid=697881: Mon Nov 23 23:33:50 2020
  read: IOPS=8485, BW=33.1MiB/s (34.8MB/s)(2048MiB/61787msec)
    slat (nsec): min=1198, max=6652.8k, avg=4617.79, stdev=13258.50
    clat (usec): min=198, max=197467, avg=3765.07, stdev=972.45
     lat (usec): min=554, max=197470, avg=3769.84, stdev=972.52
    clat percentiles (usec):
     |  1.00th=[ 2343],  5.00th=[ 2704], 10.00th=[ 2900], 20.00th=[ 3163],
     | 30.00th=[ 3359], 40.00th=[ 3523], 50.00th=[ 3654], 60.00th=[ 3818],
     | 70.00th=[ 4015], 80.00th=[ 4228], 90.00th=[ 4686], 95.00th=[ 5080],
     | 99.00th=[ 6521], 99.50th=[ 7701], 99.90th=[11469], 99.95th=[14484],
     | 99.99th=[23987]
   bw (  KiB/s): min=30240, max=35944, per=99.96%, avg=33929.11, stdev=920.58, samples=123
   iops        : min= 7560, max= 8986, avg=8482.25, stdev=230.15, samples=123
  lat (usec)   : 250=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.21%, 4=69.83%, 10=29.77%, 20=0.17%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.79%, sys=5.31%, ctx=511125, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=33.1MiB/s (34.8MB/s), 33.1MiB/s-33.1MiB/s (34.8MB/s-34.8MB/s), io=2048MiB (2147MB), run=61787-61787msec