nfs/fio-randwrite.log
job-randw: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randw;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;7162;1790;292795;1;10188;17.595074;45.053735;592;258207;17848.642505;23402.004298;1.000000%=2007;5.000000%=2539;10.000000%=2899;20.000000%=3391;30.000000%=3850;40.000000%=4423;50.000000%=5210;60.000000%=6193;70.000000%=10289;80.000000%=40632;90.000000%=50593;95.000000%=60555;99.000000%=96993;99.500000%=126353;99.900000%=168820;99.950000%=173015;99.990000%=179306;0%=0;0%=0;0%=0;606;258234;17866.740563;23404.807635;624;37320;100.000000%;7162.533333;7001.763022;1.636987%;3.227525%;353193;0;10;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.97%;31.78%;37.14%;0.91%;18.70%;9.63%;0.86%;0.01%;0.00%;0.00%;0.00%;0.00%

job-randw: (groupid=0, jobs=1): err= 0: pid=691774: Mon Nov 23 23:32:42 2020
  write: IOPS=1790, BW=7163KiB/s (7334kB/s)(2048MiB/292795msec); 0 zone resets
    slat (nsec): min=1331, max=10188k, avg=17595.07, stdev=45053.73
    clat (usec): min=592, max=258207, avg=17848.64, stdev=23402.00
     lat (usec): min=606, max=258234, avg=17866.74, stdev=23404.81
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    5], 50.00th=[    6], 60.00th=[    7],
     | 70.00th=[   11], 80.00th=[   41], 90.00th=[   51], 95.00th=[   61],
     | 99.00th=[   97], 99.50th=[  127], 99.90th=[  169], 99.95th=[  174],
     | 99.99th=[  180]
   bw (  KiB/s): min=  624, max=37320, per=100.00%, avg=7162.53, stdev=7001.76, samples=585
   iops        : min=  156, max= 9330, avg=1790.60, stdev=1750.44, samples=585
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.97%, 4=31.78%, 10=37.14%, 20=0.91%, 50=18.70%
  lat (msec)   : 100=9.63%, 250=0.86%, 500=0.01%
  cpu          : usr=1.64%, sys=3.23%, ctx=353193, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=7163KiB/s (7334kB/s), 7163KiB/s-7163KiB/s (7334kB/s-7334kB/s), io=2048MiB (2147MB), run=292795-292795msec