nfs/fio-read.log
job-r: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
3;fio-3.16;job-r;0;0;2097152;46694;364;44912;6;844;12.191289;9.925840;3433;72488;10949.663333;1880.066976;1.000000%=8290;5.000000%=9240;10.000000%=9633;20.000000%=10027;30.000000%=10289;40.000000%=10551;50.000000%=10813;60.000000%=11075;70.000000%=11337;80.000000%=11599;90.000000%=12255;95.000000%=12910;99.000000%=15794;99.500000%=18481;99.900000%=32112;99.950000%=49545;99.990000%=69730;0%=0;0%=0;0%=0;3441;72543;10962.098283;1880.400446;41728;49664;99.990303%;46689.471910;1685.194358;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.142504%;0.565563%;16654;0;139;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;19.42%;80.18%;0.33%;0.05%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-r: (groupid=0, jobs=1): err= 0: pid=691209: Mon Nov 23 23:25:26 2020
  read: IOPS=364, BW=45.6MiB/s (47.8MB/s)(2048MiB/44912msec)
    slat (usec): min=6, max=844, avg=12.19, stdev= 9.93
    clat (usec): min=3433, max=72488, avg=10949.66, stdev=1880.07
     lat (usec): min=3441, max=72543, avg=10962.10, stdev=1880.40
    clat percentiles (usec):
     |  1.00th=[ 8291],  5.00th=[ 9241], 10.00th=[ 9634], 20.00th=[10028],
     | 30.00th=[10290], 40.00th=[10552], 50.00th=[10814], 60.00th=[11076],
     | 70.00th=[11338], 80.00th=[11600], 90.00th=[12256], 95.00th=[12911],
     | 99.00th=[15795], 99.50th=[18482], 99.90th=[32113], 99.95th=[49546],
     | 99.99th=[69731]
   bw (  KiB/s): min=41728, max=49664, per=99.99%, avg=46689.47, stdev=1685.19, samples=89
   iops        : min=  326, max=  388, avg=364.75, stdev=13.16, samples=89
  lat (msec)   : 4=0.02%, 10=19.42%, 20=80.18%, 50=0.33%, 100=0.05%
  cpu          : usr=0.14%, sys=0.57%, ctx=16654, majf=0, minf=139
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=45.6MiB/s (47.8MB/s), 45.6MiB/s-45.6MiB/s (47.8MB/s-47.8MB/s), io=2048MiB (2147MB), run=44912-44912msec