nfs/fio-write.log
job-w: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
job-w: Laying out IO file (1 file / 2048MiB)
3;fio-3.16;job-w;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;46723;365;44884;8;957;34.202071;24.201137;3935;45220;10918.632647;2326.415794;1.000000%=7241;5.000000%=8159;10.000000%=8585;20.000000%=9240;30.000000%=9633;40.000000%=10158;50.000000%=10551;60.000000%=10944;70.000000%=11468;80.000000%=12255;90.000000%=13565;95.000000%=15007;99.000000%=19005;99.500000%=21102;99.900000%=25821;99.950000%=28966;99.990000%=44302;0%=0;0%=0;0%=0;3964;45268;10953.341693;2335.400301;39168;52992;99.940553%;46695.224719;3206.493170;0.554776%;1.256600%;16663;0;10;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;37.68%;61.65%;0.67%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-w: (groupid=0, jobs=1): err= 0: pid=690521: Mon Nov 23 23:24:35 2020
  write: IOPS=365, BW=45.6MiB/s (47.8MB/s)(2048MiB/44884msec); 0 zone resets
    slat (usec): min=8, max=957, avg=34.20, stdev=24.20
    clat (usec): min=3935, max=45220, avg=10918.63, stdev=2326.42
     lat (usec): min=3964, max=45268, avg=10953.34, stdev=2335.40
    clat percentiles (usec):
     |  1.00th=[ 7242],  5.00th=[ 8160], 10.00th=[ 8586], 20.00th=[ 9241],
     | 30.00th=[ 9634], 40.00th=[10159], 50.00th=[10552], 60.00th=[10945],
     | 70.00th=[11469], 80.00th=[12256], 90.00th=[13566], 95.00th=[15008],
     | 99.00th=[19006], 99.50th=[21103], 99.90th=[25822], 99.95th=[28967],
     | 99.99th=[44303]
   bw (  KiB/s): min=39168, max=52992, per=99.94%, avg=46695.22, stdev=3206.49, samples=89
   iops        : min=  306, max=  414, avg=364.80, stdev=25.05, samples=89
  lat (msec)   : 4=0.01%, 10=37.68%, 20=61.65%, 50=0.67%
  cpu          : usr=0.55%, sys=1.26%, ctx=16663, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=45.6MiB/s (47.8MB/s), 45.6MiB/s-45.6MiB/s (47.8MB/s-47.8MB/s), io=2048MiB (2147MB), run=44884-44884msec